tutorials/multiPhysics/interEddyCurrentFoam/icfSmall2Daxi/0.org/region_fluid/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    axis
    {
        type            slip;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
//     atmosphere
//     {
//         type            inletOutlet;
// //        inletValue      $internalField;
// //        value           $internalField;
// // TODO: Values?
//         inletValue      uniform 0.00375;
//         value           uniform 0.00375;
//     }
    atmosphere
    {
        type            slip;
    }
    sideWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    bottomWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
}

// ************************************************************************* //
